#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Отбор = Новый Структура();
	//Отбор.Вставить("Событие", "Отладка.ЗагрузкаПрав");
	//
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("Отбор", Отбор);
	//
	//ОткрытьФорму("Обработк.ЖурналРегистрации.Форма.ЖурналРегистрации", ПараметрыФормы, Неопределено);
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации", Неопределено);
КонецПроцедуры

#КонецОбласти