#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке для регистрации в справочнике
// дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  Структура - сведения о внешней обработке:
//   * Вид - Строка, ПеречислениеСсылка.ВидыДополнительныхОтчетовИОбработок - вид дополнительного отчета или обработки;
//   * Версия - Строка - версия обработки в формате "<Старший номер>.<Младший номер>";
//   * Назначение - Массив из Строка - полные имена объектов конфигурации, для которых предназначена обработка;
//   * Наименование - Строка - представление для администратора;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме;
//   * Разрешения - Массив из ОбъектXDTO - дополнительные разрешения для работы в безопасном режиме;
//   * Информация - Строка - краткая информация о внешней обработке;
//   * ВерсияБСП - Строка - версия библиотеки стандартных подсистем;
//   * ОпределитьНастройкиФормы - Булево - признак необходимости определить настройки формы отчета;
//   * НазначениеВариантаОтчета - ПеречислениеСсылка.НазначенияВариантовОтчетов - назначение варианта отчета;
//   * Команды - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид = "ДополнительнаяОбработка";
	ПараметрыРегистрации.Наименование = "Просмотр прав";
	ПараметрыРегистрации.Версия = "1";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = "Просмотр прав";
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Просмотр прав";
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	НоваяКоманда.Идентификатор = "РолиДляДоступаКОбъектамМетаданных";
	НоваяКоманда.Использование = "ОткрытиеФормы";   
	Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
