
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запустить1С(Команда)
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	СброситьПароль();
	
	ЗапуститьКлиентОтПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПароль1(Команда)
	УстановитьПароль();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СброситьПароль()
	
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "ИдентификаторПользователяИБ");
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		РеквизитыПользователя.ИдентификаторПользователяИБ);
		
	СохраняемоеЗначение 		= ПользовательИБ.СохраняемоеЗначениеПароля;
	ИмяПользователяИнфобазы 	= ПользовательИБ.Имя;
	АутентификацияСтандартная 	= ПользовательИБ.АутентификацияСтандартная;
	
	ПользовательИБ.АутентификацияСтандартная = Истина;
	
	ПользовательИБ.Пароль = "";
	ПользовательИБ.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПароль()
	
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "ИдентификаторПользователяИБ");
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		РеквизитыПользователя.ИдентификаторПользователяИБ);
		
	ПользовательИБ.СохраняемоеЗначениеПароля = СохраняемоеЗначение;
	ПользовательИБ.АутентификацияСтандартная = АутентификацияСтандартная;
	ПользовательИБ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьКлиентОтПользователя()
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();	
	
	ПараметрыЗапуска = " ENTERPRISE";
	ПараметрыЗапуска = ПараметрыЗапуска + " /IBConnectionString""" + СтрЗаменить(СтрокаСоединения, """", """""") + """";
	ПараметрыЗапуска = ПараметрыЗапуска + " /N""" + ИмяПользователяИнфобазы + """";
	ПараметрыЗапуска = ПараметрыЗапуска + " /P""" + ПарольПользователяИнфобазы + """";	
	ПараметрыЗапуска = ПараметрыЗапуска + " /WA-";	
	ПараметрыЗапуска = ПараметрыЗапуска + " /ClearCache";
	ПараметрыЗапуска = ПараметрыЗапуска + " /AppAutoCheckMode";
	
#Если НЕ ВебКлиент Тогда
	СтрокаЗапуска = """" + КаталогПрограммы() + "1cv8c.exe"" " + ПараметрыЗапуска;
	ЗапуститьПриложение(СтрокаЗапуска);
#КонецЕсли
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗапуститьКлиентОтПользователяЗавершение", ЭтотОбъект), "Ожидание сеанса. Нажмите ОК, когда сеанс запустится");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьКлиентОтПользователяЗавершение(ДополнительныеПараметры) Экспорт
	УстановитьПароль();	
КонецПроцедуры

#КонецОбласти


