//by Medvedev Anton Alexandrovich 2016
//Если вам помогла эта обработка, можете отблагодарить на paypal: medanton@km.ru
//Связать со мной можно по e-mail: medant@rambler.ru

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Элементы.ДеревоМетаданныхВыбран.ТриСостояния = Истина;
    Элементы.ДеревоМетаданныхВыбран.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
        
    ММета = ММетаМассив();
        
    СМета = СМетаМассив();
    НовСтр = Объект.ТЧМетаданные.Добавить();
    НовСтр.СтрНаименование = ММета[0];
    НовСтр.СтрМетаданные = СМета[0];
    
    Для н=1 по ММета.Количество()-1 Цикл
        Для Каждого Стр Из ММета[н] Цикл
            НовСтр = Объект.ТЧМетаданные.Добавить();
            НовСтр.СтрНаименование = Стр.Имя;
            НовСтр.СтрМетаданные = СМета[н];
        КонецЦикла;
    КонецЦикла;
    Объект.ТЧМетаданные.Сортировать("СтрМетаданные,СтрНаименование");
    Объект.ТЧМетаданные[0].Флаг = Истина;
    
    //Страничка с ролями
    Для каждого Роль Из Метаданные.Роли Цикл
        НовСтр = Объект.ТЧРоли.Добавить();
        НовСтр.Роль = Роль.Имя;
    КонецЦикла;
    
    МассивПользователей = ЗаполнитьМассивПользователями();
    
    Для Каждого ТекЭлемент Из МассивПользователей Цикл
        НовСтр = ТчПользователи.Добавить();
        НовСтр.Пользователь = ТекЭлемент.Имя;
        НовСтр.Идентификатор = ТекЭлемент.УникальныйИдентификатор;
    КонецЦикла;
    
    //++NM 14.01.2020 Задача № 4332
    ЗаполнитьТЧПрофили();
    //--NM 14.01.2020
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ОбновитьДеревоМетаданных("");
    ОтборДеревоМетаданных = "";
    ОтборТЧРоли = "";
    ОтборТчПользователи = "";
    ОтборТчРолиПользователя = "";
    ОтборТЧПрофили = "";
    ОтборТолькоУстановленные = Ложь;
    
    ОбновитьТЧРолиСОтбором("");
    ОбновитьТчПользователиСОтбором("");
    ОбновитьОбъединенныеРоли();
    ОбновитьТЧПрофилиСОтбором("");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборДеревоМетаданныхПриИзменении(Элемент)
    ОбновитьДеревоМетаданныхСОтбором(ОтборДеревоМетаданных);
    ПодключитьОбработчикОжидания("РазвернутьИлиСвернутьДеревоМетаданных", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборТЧРолиПриИзменении(Элемент)
    ОбновитьТЧРолиСОтбором(ОтборТЧРоли);
КонецПроцедуры

&НаКлиенте
Процедура ОтборТчПользователиПриИзменении(Элемент)
    ОбновитьТчПользователиСОтбором(ОтборТчПользователи);
КонецПроцедуры

&НаКлиенте
Процедура ОтборТчРолиПользователяПриИзменении(Элемент)
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоУстановленныеПриИзменении(Элемент)
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоМетаданных

&НаКлиенте
Процедура ДеревоМетаданныхВыбранПриИзменении(Элемент)
    
    Если Элементы.ДеревоМетаданных.ТекущиеДанные.Объект = "" Тогда//Это корень дерева
        Если Элементы.ДеревоМетаданных.ТекущиеДанные.Выбран = 2 ИЛИ Элементы.ДеревоМетаданных.ТекущиеДанные.Выбран = 0 Тогда//Выключим все подчиненые
            Элементы.ДеревоМетаданных.ТекущиеДанные.Выбран = 0;
            ТекущийКорень = ДеревоМетаданных.НайтиПоИдентификатору(Элементы.ДеревоМетаданных.ТекущаяСтрока);
            ЭлементыДерева = ТекущийКорень.ПолучитьЭлементы();
            Для Каждого ЭлементДерева ИЗ ЭлементыДерева Цикл
                ЭлементДерева.Выбран = 0;
            КонецЦикла;
        Иначе//Включим все подчиненные
            ТекущийКорень = ДеревоМетаданных.НайтиПоИдентификатору(Элементы.ДеревоМетаданных.ТекущаяСтрока);
            ЭлементыДерева = ТекущийКорень.ПолучитьЭлементы();
            Для Каждого ЭлементДерева ИЗ ЭлементыДерева Цикл
                ЭлементДерева.Выбран = 1;
            КонецЦикла;
        КонецЕсли;
    Иначе
        Если Элементы.ДеревоМетаданных.ТекущиеДанные.Выбран = 2 Тогда
            Элементы.ДеревоМетаданных.ТекущиеДанные.Выбран = 0;
        КонецЕсли;
        ЭлементыДерева = ДеревоМетаданных.ПолучитьЭлементы();
            ТекущийКорень = "";
            Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
                Если ЭлементДерева.Метаданные = Элементы.ДеревоМетаданных.ТекущиеДанные.Метаданные Тогда
                    ТекущийКорень = ЭлементДерева;
                КонецЕсли;
            КонецЦикла;
            Если НЕ ТекущийКорень = "" Тогда
                ЭлементыДерева = ТекущийКорень.ПолучитьЭлементы();
                ЕстьВыбран = Ложь;
                НетВыбран = Ложь;
                Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
                    Если ЭлементДерева.Выбран = 0 Тогда
                        НетВыбран = Истина;
                    Иначе
                        ЕстьВыбран = Истина;
                    КонецЕсли;
                КонецЦикла;
                Если НетВыбран И ЕстьВыбран Тогда
                    ТекущийКорень.Выбран = 2;
                ИначеЕсли НЕ ЕстьВыбран Тогда
                    ТекущийКорень.Выбран = 0;
                Иначе
                    ТекущийКорень.Выбран = 1;
                КонецЕсли;
            КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТчПользователи

&НаКлиенте
Процедура ТчПользователиФлагПриИзменении(Элемент)
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьОтборДеревоМетаданных(Команда)
    ОтборДеревоМетаданных = "";
    ОбновитьДеревоМетаданныхСОтбором("");
    ПодключитьОбработчикОжидания("СвернутьДеревоМетаданных", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПрава(Команда)
    
    ПолучитьПраваСервер();
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРоли(Команда)
    
    ПолучитьРолиПользователейСервер(Истина);
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПользователей(Команда)
    
    ПолучитьРолиПользователейСервер(Ложь);
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПользователейИРоли(Команда)
    
    ПолучитьПользователейИРолиСервер();
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРолиТекПользователя(Команда)
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

&НаКлиенте
Процедура ТЧРолиФлагВкл(Команда)
    Для Каждого Стр Из Объект.ТЧРоли Цикл
        Стр.Флаг = Истина;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧРолиФлагВыкл(Команда)
    Для Каждого Стр Из Объект.ТЧРоли Цикл
        Стр.Флаг = Ложь;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТчПользователиФлагВыкл(Команда)
    Для Каждого Стр Из ТчПользователи Цикл
        Стр.Флаг = Ложь;
    КонецЦикла;
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

&НаКлиенте
Процедура ТчРолиПользователяФлагВыкл(Команда)
    Для Каждого Стр Из ТчРолиПользователя Цикл
        Стр.Флаг = Ложь;
        Стр.Установлены = Ложь;
    КонецЦикла;
    Элементы.ДекорацияПользователь.Заголовок = "Установленные роли у пользователя:";
КонецПроцедуры

&НаКлиенте
Процедура ТЧПрофилиФлагВкл(Команда)
    Для каждого Стр из Объект.ТЧПрофили Цикл
        Стр.Флаг = Истина;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧПрофилиФлагВыкл(Команда)
    Для каждого Стр из Объект.ТЧПрофили Цикл
        Стр.Флаг = Ложь;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборТЧРоли(Команда)
    ОтборТЧРоли = "";
    ОбновитьТЧРолиСОтбором("");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборТчПользователи(Команда)
    ОтборТчПользователи = "";
    ОбновитьТчПользователиСОтбором("");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборТчРолиПользователя(Команда)
    ОтборТчРолиПользователя = "";
    ОтборТолькоУстановленные = Ложь;
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКакУТекущего(Команда)
    // Эта логика остаётся без изменений: копирует флаги "Флаг" из "Установлены"
    ТекИдентификатор = Элементы.ТчПользователи.ТекущиеДанные.Идентификатор;
    ПолучитьРолиТекПользователяСервер(ТекИдентификатор, "Флаг");
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

&НаКлиенте
Процедура ТЧПрофилиПолучитьПрава(Команда)
    ТЧПрофилиПолучитьПраваНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧПрофилиПолучитьПользователейИРоли(Команда)
    ТЧПрофилиПолучитьПользователейИРолиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧМетаданныеПолучитьПрофили(Команда)
    ТЧМетаданныеПолучитьПрофилиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧРолиПолучитьПрофили(Команда)
    ТЧРолиПолучитьПрофилиНаСервере();
КонецПроцедуры

// Кнопка "Дополнить новые роли"
&НаКлиенте
Процедура ДополнитьНовыеРоли(Команда)
    МИдентификаторы = Новый Массив;
    МРолей = Новый Массив;
    Для Каждого Стр Из ТчПользователи Цикл
        Если Стр.Флаг Тогда
            МИдентификаторы.Добавить(Стр.Идентификатор);
        КонецЕсли;
    КонецЦикла;
    
    Для Каждого Стр Из ТчРолиПользователя Цикл
        Если Стр.Флаг Тогда
            МРолей.Добавить(Стр.Роль);
        КонецЕсли;
    КонецЦикла;
    
    ОбновитьРолиПользователейСервер(МИдентификаторы, МРолей, Ложь);
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

// Кнопка "Перезаписать роли"
&НаКлиенте
Процедура ПерезаписатьРоли(Команда)
    МИдентификаторы = Новый Массив;
    МРолей = Новый Массив;
    Для Каждого Стр Из ТчПользователи Цикл
        Если Стр.Флаг Тогда
            МИдентификаторы.Добавить(Стр.Идентификатор);
        КонецЕсли;
    КонецЦикла;
    
    Для Каждого Стр Из ТчРолиПользователя Цикл
        Если Стр.Флаг Тогда
            МРолей.Добавить(Стр.Роль);
        КонецЕсли;
    КонецЦикла;
    
    ОбновитьРолиПользователейСервер(МИдентификаторы, МРолей, Истина);
    ОбновитьОбъединенныеРоли();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Должен быть синхронный с ММета
&НаСервере
Функция ММетаМассив()
    ММета = Новый Массив;
    
    ММета.Добавить(Метаданные);
    ММета.Добавить(Метаданные.Подсистемы);
    ММета.Добавить(Метаданные.ПараметрыСеанса);
    ММета.Добавить(Метаданные.ОбщиеРеквизиты);
    ММета.Добавить(Метаданные.ПланыОбмена);
    ММета.Добавить(Метаданные.КритерииОтбора);
    ММета.Добавить(Метаданные.ОбщиеФормы);
    ММета.Добавить(Метаданные.ОбщиеКоманды);
    ММета.Добавить(Метаданные.Константы);
    ММета.Добавить(Метаданные.Справочники);
    ММета.Добавить(Метаданные.Документы);
    ММета.Добавить(Метаданные.ЖурналыДокументов);
    ММета.Добавить(Метаданные.Отчеты);
    ММета.Добавить(Метаданные.Обработки);
    ММета.Добавить(Метаданные.ПланыВидовХарактеристик);
    ММета.Добавить(Метаданные.ПланыСчетов);
    ММета.Добавить(Метаданные.ПланыВидовРасчета);
    ММета.Добавить(Метаданные.РегистрыСведений);
    ММета.Добавить(Метаданные.РегистрыНакопления);
    ММета.Добавить(Метаданные.РегистрыБухгалтерии);
    ММета.Добавить(Метаданные.РегистрыРасчета);
    ММета.Добавить(Метаданные.БизнесПроцессы);
    ММета.Добавить(Метаданные.Задачи);
    ММета.Добавить(Метаданные.ВнешниеИсточникиДанных);
    
    Возврат ММета;
КонецФункции

//Должен быть синхронный с СМета
&НаСервере
Функция СМетаМассив()
    СМета = Новый Массив;
    
    СМета.Добавить("Метаданные");
    СМета.Добавить("Подсистемы");
    СМета.Добавить("ПараметрыСеанса");
    СМета.Добавить("ОбщиеРеквизиты");
    СМета.Добавить("ПланыОбмена");
    СМета.Добавить("КритерииОтбора");
    СМета.Добавить("ОбщиеФормы");
    СМета.Добавить("ОбщиеКоманды");
    СМета.Добавить("Константы");
    СМета.Добавить("Справочники");
    СМета.Добавить("Документы");
    СМета.Добавить("ЖурналыДокументов");
    СМета.Добавить("Отчеты");
    СМета.Добавить("Обработки");
    СМета.Добавить("ПланыВидовХарактеристик");
    СМета.Добавить("ПланыСчетов");
    СМета.Добавить("ПланыВидовРасчета");
    СМета.Добавить("РегистрыСведений");
    СМета.Добавить("РегистрыНакопления");
    СМета.Добавить("РегистрыБухгалтерии");
    СМета.Добавить("РегистрыРасчета");
    СМета.Добавить("БизнесПроцессы");
    СМета.Добавить("Задачи");
    СМета.Добавить("ВнешниеИсточникиДанных");
    
    Возврат СМета;
КонецФункции

///Раскладывает строку в массив с указанным разделителем
&НаКлиентеНаСервереБезКонтекста
Функция  СтрокуВМассив(Стр, Разделитель = ",")
    
    Если СтрДлина(Разделитель) > 1 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    НовыйМас = Новый Массив;
    ТекСтр = Стр;
    Пока СтрДлина(ТекСтр) > 0 Цикл
        Поз = СтрНайти(ТекСтр, Разделитель);
        Если Поз > 0 Тогда
            НовыйМас.Добавить(Лев(ТекСтр, Поз-1));
            ТекСтр = Сред(ТекСтр, Поз+1);
        Иначе
            НовыйМас.Добавить(ТекСтр);
            ТекСтр = "";
        КонецЕсли;
    КонецЦикла;
    Возврат НовыйМас;
КонецФункции

//Возвращает массив строк в котором указаны права доступа для объекта метаданных
&НаСервере
Функция ПолучитьПраваДляОпроса(НМетаданные, НПрава8_3 = Ложь)
    
    НаборПрав = Новый Массив;
    
    Если НМетаданные = "Метаданные" Тогда
        НаборПрав = СтрокуВМассив("Администрирование,АдминистрированиеДанных,ОбновлениеКонфигурацииБазыДанных,МонопольныйРежим,АктивныеПользователи,ЖурналРегистрации,ТонкийКлиент,ВебКлиент,ТолстыйКлиент,ВнешнееСоединение,Automation,РежимВсеФункции,СохранениеДанныхПользователя,ИнтерактивноеОткрытиеВнешнихОбработок,ИнтерактивноеОткрытиеВнешнихОтчетов,Вывод"+?(НПрава8_3, ",АдминистрированиеРасширенийКонфигурации", ""), ",");
    КонецЕсли;
    
    Если НМетаданные = "Подсистемы" Тогда
        НаборПрав.Добавить("Просмотр");
    КонецЕсли;
    
    Если НМетаданные = "ПараметрыСеанса" Тогда
        НаборПрав = СтрокуВМассив("Получение,Установка");
    КонецЕсли;
    
    Если НМетаданные = "ОбщиеРеквизиты" Тогда
        НаборПрав = СтрокуВМассив("Просмотр,Редактирование");
    КонецЕсли;
    
    Если НМетаданные = "ПланыОбмена" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке");
    КонецЕсли;
    
    Если НМетаданные = "КритерииОтбора" Тогда
        НаборПрав.Добавить("Просмотр");
    КонецЕсли;
    
    Если НМетаданные = "ОбщиеФормы" Тогда
        НаборПрав.Добавить("Просмотр");
    КонецЕсли;
    
    Если НМетаданные = "ОбщиеКоманды" Тогда
        НаборПрав.Добавить("Просмотр");
    КонецЕсли;
    
    Если НМетаданные = "Константы" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование");
    КонецЕсли;
    
    Если НМетаданные = "Справочники" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"+?(НПрава8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));
    КонецЕсли;
    
    Если НМетаданные = "Документы" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Проведение,ОтменаПроведения,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ИнтерактивноеПроведение,ИнтерактивноеПроведениеНеОперативное,ИнтерактивнаяОтменаПроведения,ИнтерактивноеИзменениеПроведенных,ВводПоСтроке");
    КонецЕсли;
    
    Если НМетаданные = "ЖурналыДокументов" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Просмотр");
    КонецЕсли;
    
    Если НМетаданные = "Отчеты" Тогда
        НаборПрав = СтрокуВМассив("Использование,Просмотр");
    КонецЕсли;
    
    Если НМетаданные = "Обработки" Тогда
        НаборПрав = СтрокуВМассив("Использование,Просмотр");
    КонецЕсли;
    
    Если НМетаданные = "ПланыВидовХарактеристик" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"+?(НПрава8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));
    КонецЕсли;
    
    Если НМетаданные = "ПланыСчетов" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"+?(НПрава8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));
    КонецЕсли;
    
    Если НМетаданные = "ПланыВидовРасчета" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке"+?(НПрава8_3, ",ИнтерактивноеУдалениеПредопределенныхДанных,ИнтерактивнаяПометкаУдаленияПредопределенныхДанных,ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных",""));
    КонецЕсли;
    
    Если НМетаданные = "РегистрыСведений" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование");
    КонецЕсли;
    
    Если НМетаданные = "РегистрыНакопления" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование,УправлениеИтогами");
    КонецЕсли;
    
    Если НМетаданные = "РегистрыБухгалтерии" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование,УправлениеИтогами");
    КонецЕсли;
    
    Если НМетаданные = "РегистрыРасчета" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Изменение,Просмотр,Редактирование");
    КонецЕсли;
    
    Если НМетаданные = "БизнесПроцессы" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке,ИнтерактивнаяАктивация,Старт,ИнтерактивныйСтарт");
    КонецЕсли;
    
    Если НМетаданные = "Задачи" Тогда
        НаборПрав = СтрокуВМассив("Чтение,Добавление,Изменение,Удаление,Просмотр,ИнтерактивноеДобавление,Редактирование,ИнтерактивноеУдаление,ИнтерактивнаяПометкаУдаления,ИнтерактивноеСнятиеПометкиУдаления,ИнтерактивноеУдалениеПомеченных,ВводПоСтроке,ИнтерактивнаяАктивация,Выполнение,ИнтерактивноеВыполнение");
    КонецЕсли;
    
    Если НМетаданные = "ВнешниеИсточникиДанных" Тогда
        НаборПрав = СтрокуВМассив("Использование,Администрирование,ИзменениеСтандартнойАутентификации,ИзменениеСтандартнойАутентификацииСеанса"+?(НПрава8_3, ",ИзменениеАутентификацииОССеанса",""));
    КонецЕсли;
    Возврат НаборПрав;
КонецФункции



&НаСервере
Процедура ПолучитьПраваСервер()
    ММета = ММетаМассив();
    СМета = СМетаМассив();
    //Для вывода прав администрирования
    МДополнение = Новый Массив;
    МДополнение.Добавить(Метаданные);
    ММета.Вставить(1, МДополнение);
    ОтчетРоли.Очистить();
    
    ПараметрыОтбора = Новый Структура("Флаг", Истина);
    НайденныеСтроки = Объект.ТЧРоли.НайтиСтроки(ПараметрыОтбора);
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
    
    ОблШапки1 = Макет.ПолучитьОбласть("Шапка1");
    ОблШапки1.Параметры.ЗаголовокОсновной = "Отчет по ролям";
    ОтчетРоли.Вывести(ОблШапки1);
    
    ОблШапки2 = Макет.ПолучитьОбласть("Шапка2");
    
    ОблШапки3 = Макет.ПолучитьОбласть("Шапка3|Столбец");
    
    ОблСтрока = Макет.ПолучитьОбласть("Строка|Столбец");
    
    ОблПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
    
    ОблСтрокаОтбора = Макет.ПолучитьОбласть("СтрокаОтбора");
    
    //Выбранные значения
    ОблШапки2.Параметры.ЗаголовокТаблицы = "Выбранные роли:";
    ОтчетРоли.Вывести(ОблШапки2);
    ОтчетРоли.НачатьГруппуСтрок("Выбранные роли", Истина);
    Для Каждого Стр Из НайденныеСтроки Цикл
        ОблСтрокаОтбора.Параметры.ЗначениеОтбора = СокрЛП(Стр.Роль);
        ОтчетРоли.Вывести(ОблСтрокаОтбора);
    КонецЦикла;
    ОтчетРоли.ЗакончитьГруппуСтрок();
    
    //Вывод результата отчета
    МРезультат = Новый Массив;
    ВывестиШапку = Истина;
    
    Для Каждого Стр Из НайденныеСтроки Цикл
        Если НЕ Стр.Флаг Тогда
            Продолжить;
        КонецЕсли;
        
        //Заголовок - Роль
        ОтчетРоли.Вывести(ОблПустаяСтрока);
        ОблШапки2.Параметры.ЗаголовокТаблицы = Стр.Роль + "  # " + Метаданные.Роли[Стр.Роль].Синоним;
        ОтчетРоли.Вывести(ОблШапки2);
        ОтчетРоли.НачатьГруппуСтрок(Метаданные.Роли[Стр.Роль].Синоним, Истина);//Начало группировки
        
        Для н=1 по ММета.Количество()-1 Цикл
            Если Не ВывестиШапку Тогда//Значит уже выводили шапку, надо закрыть группировку
                ОтчетРоли.ЗакончитьГруппуСтрок();
            КонецЕсли;
            ВывестиШапку = Истина;
            
            ПраваДляОпроса = ПолучитьПраваДляОпроса(СМета[н-1], Права8_3);
            
            Для Каждого ЭлМ Из ММета[н] Цикл
                
                МРезультат.Очистить();
                ФлагВыводить=Ложь;
                
                Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл
                    Попытка
                        РезультатОпроса = ПравоДоступа(ПраваОбъекта, ЭлМ, Метаданные.Роли[Стр.Роль]);
                    Исключение
                        СообщитьПользователю(ОписаниеОшибки());
                        РезультатОпроса = Ложь;
                    КонецПопытки;
                    МРезультат.Добавить(РезультатОпроса);
                    Если РезультатОпроса Тогда
                        ФлагВыводить = Истина;
                    КонецЕсли;
                КонецЦикла;
                
                Если Не ФлагВыводить Тогда//Нет прав ни чего не выводим
                    Продолжить;
                КонецЕсли;
                
                Если ВывестиШапку Тогда//Один раз выводим шапку для каждого типа метаданных
                    //Заголовок - Документы
                    ОтчетРоли.Вывести(ОблПустаяСтрока);
                    ОблШапки2.Параметры.ЗаголовокТаблицы = СМета[н-1];
                    ОтчетРоли.Вывести(ОблШапки2);
                    ОтчетРоли.НачатьГруппуСтрок(СМета[н-1], Истина);//Каждую табличку тоже свернем
                    
                    ОблШапки3.Параметры.ШапкаТаблицы = "Объект";
                    ОтчетРоли.Вывести(ОблШапки3);
                    ОблШапки3.Параметры.ШапкаТаблицы = "Синоним объекта";
                    ОтчетРоли.Присоединить(ОблШапки3);
                    Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл//Вывод шапки таблицы
                        ОблШапки3.Параметры.ШапкаТаблицы = ПраваОбъекта;
                        ОтчетРоли.Присоединить(ОблШапки3);
                    КонецЦикла;
                    
                    ВывестиШапку = Ложь;
                КонецЕсли;
                
                //Теперь выводим строки
                ОблСтрока.Параметры.ЗначениеСтроки = ЭлМ.Имя;
                ОтчетРоли.Вывести(ОблСтрока);
                ОблСтрока.Параметры.ЗначениеСтроки = ЭлМ.Синоним;
                ОтчетРоли.Присоединить(ОблСтрока);
                Для м=0 По МРезультат.Количество()-1 Цикл
                    Если ЗначениеЗаполнено(МРезультат[м]) Тогда
                        ОблСтрока.Параметры.ЗначениеСтроки = Строка(МРезультат[м]);
                    Иначе
                        ОблСтрока.Параметры.ЗначениеСтроки = "";
                    КонецЕсли;
                    ОтчетРоли.Присоединить(ОблСтрока);
                КонецЦикла;
            КонецЦикла;
        КонецЦикла;
        Если Не ВывестиШапку Тогда//Значит уже выводили шапку, надо закрыть группировку
            ОтчетРоли.ЗакончитьГруппуСтрок();
        КонецЕсли;
        ОтчетРоли.ЗакончитьГруппуСтрок();
    КонецЦикла;
    
КонецПроцедуры



&НаСервере
Процедура ПолучитьРолиПользователейСервер(Переключатель)
    
    ДеревоОбъект = РеквизитФормыВЗначение("ДеревоМетаданных");
    ПараметрыОтбора = Новый Структура("Выбран", 1);
    НайденныеСтроки = ДеревоОбъект.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
    
    Выборка = Неопределено;
    Если Переключатель Тогда
        Выборка = Метаданные.Роли;
    Иначе
        Выборка = ПользователиИнформационнойБазы.ПолучитьПользователей();
    КонецЕсли;
    
    // Адреса электронной почты пользователей — одним запросом (вне циклов вывода).
    КартаАдресовЭП = Новый Соответствие;
    Если Не Переключатель Тогда
        КартаАдресовЭП = ПолучитьКартуАдресовЭППользователей(Выборка);
    КонецЕсли;
    
    ОтчетПрава.Очистить();
    
    ОблШапки1 = Макет.ПолучитьОбласть("Шапка1");
    ОблШапки1.Параметры.ЗаголовокОсновной = "Отчет по метаданным";
    ОтчетПрава.Вывести(ОблШапки1);
    
    ОблШапки2 = Макет.ПолучитьОбласть("Шапка2");
    
    ОблШапки3 = Макет.ПолучитьОбласть("Шапка3|Столбец");
    
    ОблСтрока = Макет.ПолучитьОбласть("Строка|Столбец");
    
    ОблПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
    
    ОблСтрокаОтбора = Макет.ПолучитьОбласть("СтрокаОтбора");
    
    //Вывод выбранных значений
    ОблШапки2.Параметры.ЗаголовокТаблицы = "Выбранные метаданные:";
    ОтчетПрава.Вывести(ОблШапки2);
    ОтчетПрава.НачатьГруппуСтрок("Выбранные метаданные", Истина);
    Для Каждого Стр Из НайденныеСтроки Цикл
        Если СокрЛП(Стр.Объект) = "" Тогда
            Продолжить;
        КонецЕсли;
        ОблСтрокаОтбора.Параметры.ЗначениеОтбора = СокрЛП(Стр.Метаданные)+": "+СокрЛП(Стр.Объект);
        ОтчетПрава.Вывести(ОблСтрокаОтбора);
    КонецЦикла;
    ОтчетПрава.ЗакончитьГруппуСтрок();
    
    //Вывод результата по правам
    ПраваДляОпроса = "";
    ПредЗнач = "";
    МРезультат = Новый Массив;
    ЗакрытьГруппу = Ложь;
    
    Для Каждого Стр Из НайденныеСтроки Цикл
        Если СокрЛП(Стр.Объект) = "" Тогда
            Продолжить;
        КонецЕсли;
        
        Если Стр.Метаданные <> ПредЗнач Тогда//Выводим шапку для метаданных
            Если ЗакрытьГруппу Тогда
                ОтчетПрава.ЗакончитьГруппуСтрок();
                ЗакрытьГруппу = Ложь;
            КонецЕсли;
            ОтчетПрава.Вывести(ОблПустаяСтрока);
            ОблШапки2.Параметры.ЗаголовокТаблицы = СокрЛП(Стр.Метаданные);
            ОтчетПрава.Вывести(ОблШапки2);
            ОтчетПрава.НачатьГруппуСтрок(СокрЛП(Стр.Метаданные), Истина);//Начало группировки
            ЗакрытьГруппу = Истина;
            ПраваДляОпроса = ПолучитьПраваДляОпроса(СокрЛП(Стр.Метаданные), Права8_3);//Это можно один раз получать
            ОблШапки3.Параметры.ШапкаТаблицы = "Объект";
            ОтчетПрава.Вывести(ОблШапки3);
            ОблШапки3.Параметры.ШапкаТаблицы = ?(Переключатель,"Имя роли", "Имя пользователя");
            ОтчетПрава.Присоединить(ОблШапки3);
            ОблШапки3.Параметры.ШапкаТаблицы = ?(Переключатель,"Синоним роли", "Пользователь");
            ОтчетПрава.Присоединить(ОблШапки3);
            Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл//Вывод шапки таблицы
                ОблШапки3.Параметры.ШапкаТаблицы = ПраваОбъекта;
                ОтчетПрава.Присоединить(ОблШапки3);
            КонецЦикла;
            
            //++NM 14.01.2020 Задача № 4332
            Если Не Переключатель Тогда
                ОблШапки3.Параметры.ШапкаТаблицы = "Полное имя";
                ОтчетПрава.Присоединить(ОблШапки3);
                ОблШапки3.Параметры.ШапкаТаблицы = "E-mail";
                ОтчетПрава.Присоединить(ОблШапки3);
            КонецЕсли;
            //--NM 14.01.2020
            
        КонецЕсли;
        ПредЗнач = Стр.Метаданные;
        
        //Проверяем по всем ролям
        Для Каждого Элемент Из Выборка Цикл
            
            МРезультат.Очистить();
            ФлагВыводить=Ложь;
            //Проверим есть ли права у данной роли 
            Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл
                Если СокрЛП(Стр.Метаданные) = "Метаданные" Тогда
                    РезультатОпроса = ПравоДоступа(ПраваОбъекта, Метаданные, Элемент);
                Иначе
                    Попытка
                        РезультатОпроса = ПравоДоступа(ПраваОбъекта, Метаданные[СокрЛП(Стр.Метаданные)][СокрЛП(Стр.Объект)], Элемент);
                    Исключение
                        СообщитьПользователю(ОписаниеОшибки());
                        РезультатОпроса = Ложь;
                    КонецПопытки;
                КонецЕсли;
                МРезультат.Добавить(РезультатОпроса);
                Если РезультатОпроса Тогда
                    ФлагВыводить = Истина;
                КонецЕсли;
            КонецЦикла;
            
            Если НЕ ФлагВыводить Тогда//Нет прав нечего выводит тогда
                Продолжить;
            КонецЕсли;
            
            //Выводи результат по ролям
            //Имя роли
            ОблСтрока.Параметры.ЗначениеСтроки = СокрЛП(Стр.Объект);
            ОтчетПрава.Вывести(ОблСтрока);
            ОблСтрока.Параметры.ЗначениеСтроки = Элемент.Имя;
            ОтчетПрава.Присоединить(ОблСтрока);
            ОблСтрока.Параметры.ЗначениеСтроки = ?(Переключатель, Элемент.Синоним, Элемент.ПолноеИмя);
            ОтчетПрава.Присоединить(ОблСтрока);
            //Результат по объекту
            Для н=0 По МРезультат.Количество()-1 Цикл
                Если ЗначениеЗаполнено(МРезультат[н]) Тогда
                    ОблСтрока.Параметры.ЗначениеСтроки = Строка(МРезультат[н]);
                Иначе
                    ОблСтрока.Параметры.ЗначениеСтроки = "";
                КонецЕсли;
                ОтчетПрава.Присоединить(ОблСтрока);
            КонецЦикла;
            //++NM 14.01.2020 Задача № 4332
            Если Не Переключатель Тогда
                ОблСтрока.Параметры.ЗначениеСтроки = Элемент.ПолноеИмя;
                ОтчетПрава.Присоединить(ОблСтрока);
                АдресЭП = КартаАдресовЭП.Получить(Элемент.УникальныйИдентификатор);
                ОблСтрока.Параметры.ЗначениеСтроки = ?(АдресЭП = Неопределено, "", АдресЭП);
                ОтчетПрава.Присоединить(ОблСтрока);
            КонецЕсли;
            //--NM 14.01.2020
        КонецЦикла;
        
        ПредЗнач = Стр.Метаданные;
    КонецЦикла;
    Если ЗакрытьГруппу Тогда//Закроем последнюю группировку
        ОтчетПрава.ЗакончитьГруппуСтрок();
    КонецЕсли;
КонецПроцедуры





//Заполнение списка пользователями
&НаСервере
Функция ЗаполнитьМассивПользователями()
    МассивПользователей = Новый Массив;
    
    МПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
    
    Для Каждого ТекПользователь Из МПользователей Цикл
        ТекСтруктура = Новый Структура("УникальныйИдентификатор, Имя");
        ТекСтруктура.УникальныйИдентификатор = ТекПользователь.УникальныйИдентификатор;
        ТекСтруктура.Имя = ТекПользователь.Имя;
        МассивПользователей.Добавить(ТекСтруктура);
    КонецЦикла;
    
    Возврат МассивПользователей;
КонецФункции

// ========== НАЧАЛО БЛОКА ИНИЦИАЛИЗАЦИИ И ОТБОРОВ ==========



// ========== ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ ==========
&НаСервере
Функция ОтборПустой(ТекстОтбора)
    Возврат ПустаяСтрока(СокрЛП(ТекстОтбора));
КонецФункции

&НаКлиенте
Функция ЕстьОтмеченныеПользователи()
    Для Каждого Стр Из ТчПользователи Цикл
        Если Стр.Флаг Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;
    Возврат Ложь;
КонецФункции



// ========== ОТБОР ДЕРЕВА МЕТАДАННЫХ ==========
&НаСервере
&НаСервере
Процедура ОбновитьДеревоМетаданных(ТекстОтбора = "")
    ЭлементыДМ = ДеревоМетаданных.ПолучитьЭлементы();
    ЭлементыДМ.Очистить();
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ЛОЖЬ КАК Выбран,
    |    ВЫРАЗИТЬ(ТабОбъектов.СтрМетаданные КАК СТРОКА(50)) КАК Метаданные,
    |    ВЫРАЗИТЬ(ТабОбъектов.СтрНаименование КАК СТРОКА(100)) КАК Объект
    |ПОМЕСТИТЬ СтрокиМета
    |ИЗ
    |    &ТабРез КАК ТабОбъектов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    СтрокиМета.Выбран,
    |    СтрокиМета.Метаданные КАК Метаданные,
    |    СтрокиМета.Объект
    |ИЗ
    |    СтрокиМета КАК СтрокиМета
    |ГДЕ
    |    &ПустойОтбор ИЛИ СтрокиМета.Метаданные ПОДОБНО &ТекстОтбора
    |       ИЛИ СтрокиМета.Объект ПОДОБНО &ТекстОтбора
    |ИТОГИ ПО
    |    Метаданные";
    
    ТекТаб = Объект.ТЧМетаданные.Выгрузить();
    Запрос.УстановитьПараметр("ТабРез", ТекТаб);
    
    ПустойОтбор = ОтборПустой(ТекстОтбора);
    Запрос.УстановитьПараметр("ПустойОтбор", ПустойОтбор);
    Если НЕ ПустойОтбор Тогда
        Запрос.УстановитьПараметр("ТекстОтбора", "%" + СокрЛП(ТекстОтбора) + "%");
    Иначе
        Запрос.УстановитьПараметр("ТекстОтбора", "%");
    КонецЕсли;
    
    ДеревоРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
    ЗначениеВРеквизитФормы(ДеревоРезультат, "ДеревоМетаданных");
КонецПроцедуры



&НаКлиенте
Процедура РазвернутьИлиСвернутьДеревоМетаданных()
    Попытка
        Если ПустаяСтрока(СокрЛП(ОтборДеревоМетаданных)) Тогда
            Элементы.ДеревоМетаданных.Свернуть(0);
        Иначе
            Элементы.ДеревоМетаданных.Развернуть(0, Истина);
        КонецЕсли;
    Исключение
        Возврат;
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоМетаданных()
    Попытка
        Элементы.ДеревоМетаданных.Свернуть(0);
    Исключение
        Возврат;
    КонецПопытки;
КонецПроцедуры


&НаСервере
Процедура ОбновитьДеревоМетаданныхСОтбором(ТекстОтбора)
    ОбновитьДеревоМетаданных(ТекстОтбора);
КонецПроцедуры


// ========== ОТБОР ТАБЛИЦЫ РОЛЕЙ (ТЧРоли) ==========
&НаСервере
Процедура ОбновитьТЧРоли(ТекстОтбора)
    Объект.ТЧРоли.Очистить();
    Если ОтборПустой(ТекстОтбора) Тогда
        Для каждого Роль Из Метаданные.Роли Цикл
            НовСтр = Объект.ТЧРоли.Добавить();
            НовСтр.Роль = Роль.Имя;
        КонецЦикла;
    Иначе
        СтрокаПоиска = ВРег(СокрЛП(ТекстОтбора));
        Для каждого Роль Из Метаданные.Роли Цикл
            Если СтрНайти(ВРег(Роль.Имя), СтрокаПоиска) > 0 Тогда
                НовСтр = Объект.ТЧРоли.Добавить();
                НовСтр.Роль = Роль.Имя;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры





&НаСервере
Процедура ОбновитьТЧРолиСОтбором(ТекстОтбора)
    ОбновитьТЧРоли(ТекстОтбора);
КонецПроцедуры

// ========== ОТБОР ТАБЛИЦЫ ПОЛЬЗОВАТЕЛЕЙ (ТчПользователи) ==========
&НаСервере
Процедура ОбновитьТчПользователи(ТекстОтбора)
    ТчПользователи.Очистить();
    МПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
    Если ОтборПустой(ТекстОтбора) Тогда
        Для Каждого ТекПользователь Из МПользователей Цикл
            НовСтр = ТчПользователи.Добавить();
            НовСтр.Пользователь = ТекПользователь.Имя;
            НовСтр.Идентификатор = ТекПользователь.УникальныйИдентификатор;
        КонецЦикла;
    Иначе
        СтрокаПоиска = ВРег(СокрЛП(ТекстОтбора));
        Для Каждого ТекПользователь Из МПользователей Цикл
            Если СтрНайти(ВРег(ТекПользователь.Имя), СтрокаПоиска) > 0 Тогда
                НовСтр = ТчПользователи.Добавить();
                НовСтр.Пользователь = ТекПользователь.Имя;
                НовСтр.Идентификатор = ТекПользователь.УникальныйИдентификатор;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры





&НаСервере
Процедура ОбновитьТчПользователиСОтбором(ТекстОтбора)
    ОбновитьТчПользователи(ТекстОтбора);
КонецПроцедуры

// ========== ОТБОР ТАБЛИЦЫ ПРОФИЛЕЙ (ТЧПрофили) ==========
&НаСервере
Процедура ОбновитьТЧПрофили(ТекстОтбора)
    Объект.ТЧПрофили.Очистить();
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ПрофилиГруппДоступа.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
        |ГДЕ
        |    НЕ ПрофилиГруппДоступа.ПометкаУдаления
        |    И (&ПустойОтбор ИЛИ ПрофилиГруппДоступа.Наименование ПОДОБНО &ТекстОтбора)
        |УПОРЯДОЧИТЬ ПО
        |    ПрофилиГруппДоступа.Наименование";
    
    ПустойОтбор = ОтборПустой(ТекстОтбора);
    Запрос.УстановитьПараметр("ПустойОтбор", ПустойОтбор);
    Если НЕ ПустойОтбор Тогда
        Запрос.УстановитьПараметр("ТекстОтбора", "%" + СокрЛП(ТекстОтбора) + "%");
    Иначе
        Запрос.УстановитьПараметр("ТекстОтбора", "%");
    КонецЕсли;
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        НовСтр = Объект.ТЧПрофили.Добавить();
        НовСтр.Профиль = Выборка.Ссылка;
    КонецЦикла;
КонецПроцедуры





&НаСервере
Процедура ОбновитьТЧПрофилиСОтбором(ТекстОтбора)
    ОбновитьТЧПрофили(ТекстОтбора);
КонецПроцедуры

// ========== НОВАЯ ЛОГИКА ДЛЯ ТАБЛИЦЫ РОЛЕЙ ПОЛЬЗОВАТЕЛЯ (ОБЪЕДИНЕНИЕ) ==========

// НОВАЯ СЕРВЕРНАЯ ПРОЦЕДУРА - ЗАМЕНЯЕТ ВСЕ СТАРЫЕ
&НаСервере
Процедура ПересчитатьОбъединенныеРолиПользователей(ТекстОтбора, ТолькоУстановленные)
    // Получаем всех отмеченных пользователей
    МИдентификаторы = Новый Массив;
    Для Каждого Стр Из ТчПользователи Цикл
        Если Стр.Флаг Тогда
            МИдентификаторы.Добавить(Стр.Идентификатор);
        КонецЕсли;
    КонецЦикла;
    
    // Строим объединение ролей
    ОбъединенныеРоли = Новый Соответствие;
    Для Каждого Ид Из МИдентификаторы Цикл
        ТекПользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Ид);
        Если ТекПользователь <> Неопределено Тогда
            Для Каждого РольПользователя Из ТекПользователь.Роли Цикл
                ОбъединенныеРоли.Вставить(РольПользователя.Имя, Истина);
            КонецЦикла;
        КонецЕсли;
    КонецЦикла;
    
    // Заполняем таблицу ТчРолиПользователя с учётом объединения и фильтров
    ТчРолиПользователя.Очистить();
    СтрокаПоиска = ВРег(СокрЛП(ТекстОтбора));
    
    Для каждого Роль Из Метаданные.Роли Цикл
        // Текстовый фильтр
        Если НЕ ОтборПустой(ТекстОтбора) И СтрНайти(ВРег(Роль.Имя), СтрокаПоиска) = 0 Тогда
            Продолжить;
        КонецЕсли;
        
        Установлена = (ОбъединенныеРоли.Получить(Роль.Имя) <> Неопределено);
        
        // Фильтр "Только установленные"
        Если ТолькоУстановленные И НЕ Установлена Тогда
            Продолжить;
        КонецЕсли;
        
        НовСтр = ТчРолиПользователя.Добавить();
        НовСтр.Роль = Роль.Имя;
        НовСтр.Флаг = Ложь;
        НовСтр.Установлены = Установлена;
    КонецЦикла;
КонецПроцедуры

// НОВАЯ КЛИЕНТСКАЯ ПРОЦЕДУРА ДЛЯ ВЫЗОВА ПЕРЕСЧЁТА
&НаКлиенте
Процедура ОбновитьОбъединенныеРоли()
    ПересчитатьОбъединенныеРолиПользователей(ОтборТчРолиПользователя, ОтборТолькоУстановленные);
    ОбновитьЗаголовокДекорации();
КонецПроцедуры

// Обновление заголовка декорации с именами отмеченных пользователей
&НаКлиенте
Процедура ОбновитьЗаголовокДекорации()
    Если ЕстьОтмеченныеПользователи() Тогда
        Имена = Новый Массив;
        Для Каждого Стр Из ТчПользователи Цикл
            Если Стр.Флаг Тогда
                Имена.Добавить(Стр.Пользователь);
            КонецЕсли;
        КонецЦикла;
        Заголовок = "Установленные роли у пользователей: " + СтрСоединить(Имена, ", ");
    Иначе
        Заголовок = "Установленные роли у пользователя:";
    КонецЕсли;
    Элементы.ДекорацияПользователь.Заголовок = Заголовок;
КонецПроцедуры

// ========== ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ПОЛЬЗОВАТЕЛЕЙ ==========

// ЗАМЕНА СТАРОЙ ПРОЦЕДУРЫ ТчПользователиФлагВыкл и ТчПользователиФлагПриИзменении


// Обработчик кнопки "Снять выбор" в таблице пользователей (оставляем для совместимости)




// ========== ОБРАБОТЧИКИ ФИЛЬТРОВ ТАБЛИЦЫ РОЛЕЙ ПОЛЬЗОВАТЕЛЯ ==========







// ========== КНОПКИ ДЕЙСТВИЙ С РОЛЯМИ ==========

// Кнопка "Получить роли выбранного пользователя" больше не нужна, но оставим вызов обновления


// Кнопка "Установить как у выбранного пользователя"


// Серверная процедура для получения ролей конкретного пользователя (оставляем)
&НаСервере
Процедура ПолучитьРолиТекПользователяСервер(ТекИдентификатор, КолонкаФлага = "Установлены")
    ТекПользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекИдентификатор);
    ТабРолиПользователей = РеквизитФормыВЗначение("ТчРолиПользователя");
    ТабРолиПользователей.ЗаполнитьЗначения(Ложь, КолонкаФлага);
    СОтбор = Новый Структура("Роль");
    Для Каждого ТекРоль Из ТекПользователь.Роли Цикл
        СОтбор.Роль = ТекРоль.Имя;
        нСтроки = ТабРолиПользователей.НайтиСтроки(СОтбор);
        Если нСтроки.Количество() > 0 Тогда
            нСтроки[0][КолонкаФлага] = Истина;
        КонецЕсли;
    КонецЦикла;
    ЗначениеВРеквизитФормы(ТабРолиПользователей, "ТчРолиПользователя");
КонецПроцедуры





// Серверная процедура для изменения ролей пользователей (без изменений)
&НаСервере
Процедура ОбновитьРолиПользователейСервер(МИдентификаторов, МРолей, Очистить)
    
    Для Каждого ТекИдентификатор Из МИдентификаторов Цикл
        
        ТекПользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекИдентификатор);
        
        Если Очистить Тогда
            ТекПользователь.Роли.Очистить();
        КонецЕсли;
        
        НужноЗаписать = Ложь;
        Для Каждого ТекРоль Из МРолей Цикл
            Если НЕ ТекПользователь.Роли.Содержит(Метаданные.Роли[ТекРоль]) Тогда
                ТекПользователь.Роли.Добавить(Метаданные.Роли[ТекРоль]);
                НужноЗаписать = Истина;
            КонецЕсли;
        КонецЦикла;
        Если НужноЗаписать Тогда
            ТекПользователь.Записать();
            СообщитьПользователю("Для пользователя: "+ТекПользователь.Имя+" изменен состав ролей!");
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

// Кнопка очистки флагов в таблице ролей пользователя (оставляем без изменений)


// ========== ОРИГИНАЛЬНЫЕ ПРОЦЕДУРЫ (БЕЗ ИЗМЕНЕНИЙ) ==========





//Получение матрицы по пользователям


&НаСервере
Процедура ПолучитьПользователейИРолиСервер()
    
    ОтчетРоли.Очистить();
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
    
    ОблШапки1 = Макет.ПолучитьОбласть("Шапка1");
    ОблШапки1.Параметры.ЗаголовокОсновной = "Отчет по ролям пользователей";
    ОтчетРоли.Вывести(ОблШапки1);
    
    МРолей = Новый Массив;//Состав ролей по которым будем выводить отчет
    Для Каждого Стр Из Объект.ТЧРоли Цикл
        Если Стр.Флаг Тогда
            МРолей.Добавить(Стр.Роль);
        КонецЕсли;
    КонецЦикла;
    
    МПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
    
    ОблШапкиП = Макет.ПолучитьОбласть("ШапкаП|СтолбецШ");
    ОблШапкиП.Параметры.КолонкиОтчета = "Пользователи";
    ОтчетРоли.Вывести(ОблШапкиП);
    ОблШапкиП = Макет.ПолучитьОбласть("ШапкаП|СтолбецП");
    Для Каждого ТекПользователь Из МПользователей Цикл
        ОблШапкиП.Параметры.Пользователь = ТекПользователь.Имя;
        ОтчетРоли.Присоединить(ОблШапкиП);
    КонецЦикла;
    
    ОблСтрокаП = Макет.ПолучитьОбласть("СтрокаП|СтолбецШ");
    ОблРезультат = Макет.ПолучитьОбласть("СтрокаП|СтолбецП");
    Для Каждого ТекРоль Из МРолей Цикл
        ОблСтрокаП.Параметры.Роль = ТекРоль;
        ОтчетРоли.Вывести(ОблСтрокаП);
        Для Каждого ТекПользователь Из МПользователей Цикл
            РолиПользователя = ТекПользователь.Роли;
            стрРезультат = "";
            Если РолиПользователя.Содержит(Метаданные.Роли[ТекРоль]) Тогда
                стрРезультат = "Да";
            КонецЕсли;
            ОблРезультат.Параметры.ЗначениеСтроки = стрРезультат;
            ОтчетРоли.Присоединить(ОблРезультат);
            
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

//Установка флажков




//++NM 14.01.2020 Задача № 4332












&НаСервере
Процедура ЗаполнитьТЧПрофили()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ПрофилиГруппДоступа.Ссылка КАК Ссылка
        |ИЗ
        |    Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
        |ГДЕ
        |    НЕ ПрофилиГруппДоступа.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |    ПрофилиГруппДоступа.Наименование";
    
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        НовСтр = Объект.ТЧПрофили.Добавить();
        НовСтр.Профиль = ВыборкаДетальныеЗаписи.Ссылка;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ТЧПрофилиПолучитьПраваНаСервере()
    
    ММета = ММетаМассив();
    СМета = СМетаМассив();
    //Для вывода прав администрирования
    МДополнение = Новый Массив;
    МДополнение.Добавить(Метаданные);
    ММета.Вставить(1, МДополнение);
    ОтчетПрофили.Очистить();
    
    ПараметрыОтбора = Новый Структура("Флаг", Истина);
    НайденныеСтроки = Объект.ТЧПрофили.НайтиСтроки(ПараметрыОтбора);
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
    
    ОблШапки1 = Макет.ПолучитьОбласть("Шапка1");
    ОблШапки1.Параметры.ЗаголовокОсновной = "Отчет по профилям групп доступа";
    ОтчетПрофили.Вывести(ОблШапки1);
    
    ОблШапки2 = Макет.ПолучитьОбласть("Шапка2");
    
    ОблШапки3 = Макет.ПолучитьОбласть("Шапка3|Столбец");
    
    ОблСтрока = Макет.ПолучитьОбласть("Строка|Столбец");
    
    ОблПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
    
    ОблСтрокаОтбора = Макет.ПолучитьОбласть("СтрокаОтбора");
    
    //Выбранные значения
    ОблШапки2.Параметры.ЗаголовокТаблицы = "Выбранные профили:";
    ОтчетПрофили.Вывести(ОблШапки2);
    ОтчетПрофили.НачатьГруппуСтрок("Выбранные профили", Истина);
    
    ЗапросВсехРолей = Новый Запрос;
    ЗапросВсехРолей.Текст = 
        "ВЫБРАТЬ
        |	Роли.Ссылка КАК Профиль,
        |	Роли.Роль КАК Роль,
        |	Роли.Роль.Имя КАК ИмяРоли
        |ИЗ
        |	Справочник.ПрофилиГруппДоступа.Роли КАК Роли";
    ВсеРолиПрофилей = ЗапросВсехРолей.Выполнить().Выгрузить();
    
    Для Каждого Стр Из НайденныеСтроки Цикл
        ОблСтрокаОтбора.Параметры.ЗначениеОтбора = СокрЛП(Стр.Профиль);
        ОтчетПрофили.Вывести(ОблСтрокаОтбора);
    КонецЦикла;
    ОтчетПрофили.ЗакончитьГруппуСтрок();
    
    //Вывод результата отчета
    МРезультат = Новый Массив;
    ВывестиШапку = Истина;
    
    Для Каждого Стр Из НайденныеСтроки Цикл
        Если НЕ Стр.Флаг Тогда
            Продолжить;
        КонецЕсли;
        
        //Заголовок - Профиль группы доступа
        ОтчетПрофили.Вывести(ОблПустаяСтрока);
        НаименованиеПрофиля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Профиль, "Наименование");
        ОблШапки2.Параметры.ЗаголовокТаблицы = НаименованиеПрофиля;
        ОтчетПрофили.Вывести(ОблШапки2);
        ОтчетПрофили.НачатьГруппуСтрок(НаименованиеПрофиля, Истина);//Начало группировки
        
        РолиПрофиля = ВсеРолиПрофилей.НайтиСтроки(Новый Структура("Профиль", Стр.Профиль));
        
        Для н=1 по ММета.Количество()-1 Цикл
            Если Не ВывестиШапку Тогда//Значит уже выводили шапку, надо закрыть группировку
                ОтчетПрофили.ЗакончитьГруппуСтрок();
            КонецЕсли;
            ВывестиШапку = Истина;
            
            ПраваДляОпроса = ПолучитьПраваДляОпроса(СМета[н-1], Права8_3);
            
            Для Каждого ЭлМ Из ММета[н] Цикл
                
                МРезультат.Очистить();
                ФлагВыводить=Ложь;
                
                Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл
                    
                    Для Каждого РольТЧ из РолиПрофиля Цикл
                        
                        Попытка
                            РезультатОпроса = ПравоДоступа(ПраваОбъекта, ЭлМ, Метаданные.Роли[РольТЧ.ИмяРоли]);
                        Исключение
                            СообщитьПользователю(ОписаниеОшибки());
                            РезультатОпроса = Ложь;
                        КонецПопытки;
                        Если РезультатОпроса Тогда
                            Прервать;
                        КонецЕсли;
                        
                    КонецЦикла;
                    
                    МРезультат.Добавить(РезультатОпроса);
                    Если РезультатОпроса Тогда
                        ФлагВыводить = Истина;
                    КонецЕсли;
                    
                КонецЦикла;
                
                Если Не ФлагВыводить Тогда//Нет прав ни чего не выводим
                    Продолжить;
                КонецЕсли;
                
                Если ВывестиШапку Тогда//Один раз выводим шапку для каждого типа метаданных
                    //Заголовок - Документы
                    ОтчетПрофили.Вывести(ОблПустаяСтрока);
                    ОблШапки2.Параметры.ЗаголовокТаблицы = СМета[н-1];
                    ОтчетПрофили.Вывести(ОблШапки2);
                    ОтчетПрофили.НачатьГруппуСтрок(СМета[н-1], Истина);//Каждую табличку тоже свернем
                    
                    ОблШапки3.Параметры.ШапкаТаблицы = "Объект";
                    ОтчетПрофили.Вывести(ОблШапки3);
                    ОблШапки3.Параметры.ШапкаТаблицы = "Синоним объекта";
                    ОтчетПрофили.Присоединить(ОблШапки3);
                    Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл//Вывод шапки таблицы
                        ОблШапки3.Параметры.ШапкаТаблицы = ПраваОбъекта;
                        ОтчетПрофили.Присоединить(ОблШапки3);
                    КонецЦикла;
                    
                    ВывестиШапку = Ложь;
                КонецЕсли;
                
                //Теперь выводим строки
                ОблСтрока.Параметры.ЗначениеСтроки = ЭлМ.Имя;
                ОтчетПрофили.Вывести(ОблСтрока);
                ОблСтрока.Параметры.ЗначениеСтроки = ЭлМ.Синоним;
                ОтчетПрофили.Присоединить(ОблСтрока);
                Для м=0 По МРезультат.Количество()-1 Цикл
                    Если ЗначениеЗаполнено(МРезультат[м]) Тогда
                        ОблСтрока.Параметры.ЗначениеСтроки = Строка(МРезультат[м]);
                    Иначе
                        ОблСтрока.Параметры.ЗначениеСтроки = "";
                    КонецЕсли;
                    ОтчетПрофили.Присоединить(ОблСтрока);
                КонецЦикла;
            КонецЦикла;
        КонецЦикла;
        Если Не ВывестиШапку Тогда//Значит уже выводили шапку, надо закрыть группировку
            ОтчетПрофили.ЗакончитьГруппуСтрок();
        КонецЕсли;
        ОтчетПрофили.ЗакончитьГруппуСтрок();
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ТЧПрофилиПолучитьПользователейИРолиНаСервере()
    
    ОтчетПрофили.Очистить();
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
    
    ОблШапки1 = Макет.ПолучитьОбласть("Шапка1");
    ОблШапки1.Параметры.ЗаголовокОсновной = "Отчет по профилям групп доступа";
    ОтчетПрофили.Вывести(ОблШапки1);
    
    МПрофилей = Новый Массив;//Профили, по которым будем выводить отчет
    Для Каждого Стр Из Объект.ТЧПрофили Цикл
        Если Стр.Флаг Тогда
            МПрофилей.Добавить(Стр.Профиль);
        КонецЕсли;
    КонецЦикла;
    
    МПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
    
    КартаВхождения = ПостроитьКартуВхожденияПользователейВПрофили(МПользователей, МПрофилей);
    
    ОблШапкиП = Макет.ПолучитьОбласть("ШапкаП|СтолбецШ");
    ОблШапкиП.Параметры.КолонкиОтчета = "Пользователи";
    ОтчетПрофили.Вывести(ОблШапкиП);
    ОблШапкиП = Макет.ПолучитьОбласть("ШапкаП|СтолбецП");
    Для Каждого ТекПользователь Из МПользователей Цикл
        ОблШапкиП.Параметры.Пользователь = ТекПользователь.Имя;
        ОтчетПрофили.Присоединить(ОблШапкиП);
    КонецЦикла;
    
    ОблСтрокаП = Макет.ПолучитьОбласть("СтрокаП|СтолбецШ");
    ОблРезультат = Макет.ПолучитьОбласть("СтрокаП|СтолбецП");
    Для Каждого ТекПрофиль Из МПрофилей Цикл
        ОблСтрокаП.Параметры.Роль = ТекПрофиль.Наименование;
        ОтчетПрофили.Вывести(ОблСтрокаП);
        Для Каждого ТекПользователь Из МПользователей Цикл
            стрРезультат = "";
            ПоПрофилям = КартаВхождения.Получить(ТекПользователь.УникальныйИдентификатор);
            Если ПоПрофилям <> Неопределено И ПоПрофилям.Получить(ТекПрофиль) = Истина Тогда
                стрРезультат = "Да";
            КонецЕсли;
            ОблРезультат.Параметры.ЗначениеСтроки = стрРезультат;
            ОтчетПрофили.Присоединить(ОблРезультат);
            
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Функция ПостроитьКартуВхожденияПользователейВПрофили(МПользователей, МПрофилей)
    
    Результат = Новый Соответствие;
    
    СписокУИД = Новый Массив;
    Для Каждого ТекПользователь Из МПользователей Цикл
        СписокУИД.Добавить(ТекПользователь.УникальныйИдентификатор);
    КонецЦикла;
    
    Если СписокУИД.Количество() = 0 ИЛИ МПрофилей.Количество() = 0 Тогда
        Возврат Результат;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ РАЗЛИЧНЫЕ
        |    ГруппыДоступаПользователи.Пользователь.ИдентификаторПользователяИБ КАК УИД,
        |    ГруппыДоступаПользователи.Ссылка.Профиль КАК Профиль
        |ИЗ
        |    Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
        |ГДЕ
        |    ГруппыДоступаПользователи.Пользователь.ИдентификаторПользователяИБ В(&СписокУИД)
        |    И ГруппыДоступаПользователи.Ссылка.Профиль В(&СписокПрофилей)
        |    И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
        |    И НЕ ГруппыДоступаПользователи.Ссылка.Профиль.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("СписокУИД", СписокУИД);
    Запрос.УстановитьПараметр("СписокПрофилей", МПрофилей);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        ПоПрофилям = Результат.Получить(Выборка.УИД);
        Если ПоПрофилям = Неопределено Тогда
            ПоПрофилям = Новый Соответствие;
            Результат.Вставить(Выборка.УИД, ПоПрофилям);
        КонецЕсли;
        ПоПрофилям.Вставить(Выборка.Профиль, Истина);
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

&НаСервере
Функция ПолучитьКартуАдресовЭППользователей(МПользователей)
    
    Результат = Новый Соответствие;
    
    СписокУИД = Новый Массив;
    Для Каждого ТекПользователь Из МПользователей Цикл
        СписокУИД.Добавить(ТекПользователь.УникальныйИдентификатор);
    КонецЦикла;
    
    Если СписокУИД.Количество() = 0 Тогда
        Возврат Результат;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ПользователиКонтактнаяИнформация.Ссылка.ИдентификаторПользователяИБ КАК УИД,
        |    ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП
        |ИЗ
        |    Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
        |ГДЕ
        |    ПользователиКонтактнаяИнформация.Ссылка.ИдентификаторПользователяИБ В(&СписокУИД)
        |    И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
        |    И ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя)
        |    И НЕ ПользователиКонтактнаяИнформация.Ссылка.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("СписокУИД", СписокУИД);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Если Результат.Получить(Выборка.УИД) = Неопределено Тогда
            Результат.Вставить(Выборка.УИД, Выборка.АдресЭП);
        КонецЕсли;
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

&НаСервере
Процедура ТЧМетаданныеПолучитьПрофилиНаСервере()
    
    ДеревоОбъект = РеквизитФормыВЗначение("ДеревоМетаданных");
    ПараметрыОтбора = Новый Структура("Выбран", 1);
    НайденныеСтроки = ДеревоОбъект.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
    
    Выборка = ПолучитьВсеПрофилиГруппДоступа();
    
    ОтчетПрава.Очистить();
    
    ОблШапки1 = Макет.ПолучитьОбласть("Шапка1");
    ОблШапки1.Параметры.ЗаголовокОсновной = "Отчет по метаданным";
    ОтчетПрава.Вывести(ОблШапки1);
    
    ОблШапки2 = Макет.ПолучитьОбласть("Шапка2");
    
    ОблШапки3 = Макет.ПолучитьОбласть("Шапка3|Столбец");
    
    ОблСтрока = Макет.ПолучитьОбласть("Строка|Столбец");
    
    ОблПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
    
    ОблСтрокаОтбора = Макет.ПолучитьОбласть("СтрокаОтбора");
    
    //Вывод выбранных значений
    ОблШапки2.Параметры.ЗаголовокТаблицы = "Выбранные метаданные:";
    ОтчетПрава.Вывести(ОблШапки2);
    ОтчетПрава.НачатьГруппуСтрок("Выбранные метаданные", Истина);
    Для Каждого Стр Из НайденныеСтроки Цикл
        Если СокрЛП(Стр.Объект) = "" Тогда
            Продолжить;
        КонецЕсли;
        ОблСтрокаОтбора.Параметры.ЗначениеОтбора = СокрЛП(Стр.Метаданные)+": "+СокрЛП(Стр.Объект);
        ОтчетПрава.Вывести(ОблСтрокаОтбора);
    КонецЦикла;
    ОтчетПрава.ЗакончитьГруппуСтрок();
    
    //Вывод результата по правам
    ПраваДляОпроса = "";
    ПредЗнач = "";
    МРезультат = Новый Массив;
    ЗакрытьГруппу = Ложь;
    
    Для Каждого Стр Из НайденныеСтроки Цикл
        Если СокрЛП(Стр.Объект) = "" Тогда
            Продолжить;
        КонецЕсли;
        
        Если Стр.Метаданные <> ПредЗнач Тогда//Выводим шапку для метаданных
            Если ЗакрытьГруппу Тогда
                ОтчетПрава.ЗакончитьГруппуСтрок();
                ЗакрытьГруппу = Ложь;
            КонецЕсли;
            ОтчетПрава.Вывести(ОблПустаяСтрока);
            ОблШапки2.Параметры.ЗаголовокТаблицы = СокрЛП(Стр.Метаданные);
            ОтчетПрава.Вывести(ОблШапки2);
            ОтчетПрава.НачатьГруппуСтрок(СокрЛП(Стр.Метаданные), Истина);//Начало группировки
            ЗакрытьГруппу = Истина;
            ПраваДляОпроса = ПолучитьПраваДляОпроса(СокрЛП(Стр.Метаданные), Права8_3);//Это можно один раз получать
            ОблШапки3.Параметры.ШапкаТаблицы = "Объект";
            ОтчетПрава.Вывести(ОблШапки3);
            ОблШапки3.Параметры.ШапкаТаблицы = "Наименование профиля групп доступа";
            ОтчетПрава.Присоединить(ОблШапки3);
            Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл//Вывод шапки таблицы
                ОблШапки3.Параметры.ШапкаТаблицы = ПраваОбъекта;
                ОтчетПрава.Присоединить(ОблШапки3);
            КонецЦикла;
        КонецЕсли;
        ПредЗнач = Стр.Метаданные;
        
        //Проверяем по всем профилям групп доступа
        Пока Выборка.Следующий() Цикл
            
            ИдентификаторыРолей = Выборка.Профиль.Роли.ВыгрузитьКолонку("Роль");
            ПрочитанныеРоли = Справочники.ИдентификаторыОбъектовМетаданных.ОбъектыМетаданныхПоИдентификаторам(
                ИдентификаторыРолей, Истина);
            
            МРезультат.Очистить();
            ФлагВыводить=Ложь;
            //Проверим есть ли права у данной роли 
            Для Каждого ПраваОбъекта Из ПраваДляОпроса Цикл
                
                Для каждого Элемент из ПрочитанныеРоли Цикл
                    
                    Если СокрЛП(Стр.Метаданные) = "Метаданные" Тогда
                        РезультатОпроса = ПравоДоступа(ПраваОбъекта, Метаданные, Элемент.Значение);
                    Иначе
                        Попытка
                            РезультатОпроса = ПравоДоступа(ПраваОбъекта, Метаданные[СокрЛП(Стр.Метаданные)][СокрЛП(Стр.Объект)], Элемент.Значение);
                        Исключение
                            СообщитьПользователю(ОписаниеОшибки());
                            РезультатОпроса = Ложь;
                        КонецПопытки;
                    КонецЕсли;
                    
                    Если РезультатОпроса Тогда
                        ФлагВыводить = Истина;
                        Прервать;
                    КонецЕсли;
                    
                КонецЦикла;
                
                МРезультат.Добавить(РезультатОпроса);
                
            КонецЦикла;
            
            Если НЕ ФлагВыводить Тогда
                Продолжить;
            КонецЕсли;
            
            //Выводим результат по профилям
            //Имя профиля
            ОблСтрока.Параметры.ЗначениеСтроки = СокрЛП(Стр.Объект);
            ОтчетПрава.Вывести(ОблСтрока);
            ОблСтрока.Параметры.ЗначениеСтроки = Выборка.Профиль.Наименование;
            ОтчетПрава.Присоединить(ОблСтрока);
            //Результат по объекту
            Для н=0 По МРезультат.Количество()-1 Цикл
                Если ЗначениеЗаполнено(МРезультат[н]) Тогда
                    ОблСтрока.Параметры.ЗначениеСтроки = Строка(МРезультат[н]);
                Иначе
                    ОблСтрока.Параметры.ЗначениеСтроки = "";
                КонецЕсли;
                ОтчетПрава.Присоединить(ОблСтрока);
            КонецЦикла;
        КонецЦикла;
        Выборка.Сбросить();
        
        ПредЗнач = Стр.Метаданные;
    КонецЦикла;
    Если ЗакрытьГруппу Тогда//Закроем последнюю группировку
        ОтчетПрава.ЗакончитьГруппуСтрок();
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ТЧРолиПолучитьПрофилиНаСервере()
    
    ОтчетРоли.Очистить();
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
    
    ОблШапки1 = Макет.ПолучитьОбласть("Шапка1");
    ОблШапки1.Параметры.ЗаголовокОсновной = "Отчет по профилям групп доступа с указанными ролями";
    ОтчетРоли.Вывести(ОблШапки1);
    
    МРолей = Новый Массив;//Состав ролей по которым будем выводить отчет
    Для Каждого Стр Из Объект.ТЧРоли Цикл
        Если Стр.Флаг Тогда
            МРолей.Добавить(Стр.Роль);
        КонецЕсли;
    КонецЦикла;
    
    Выборка = ПолучитьВсеПрофилиГруппДоступа();
    
    ОблШапкиП = Макет.ПолучитьОбласть("ШапкаП|СтолбецШ");
    ОблШапкиП.Параметры.КолонкиОтчета = "Профили";
    ОтчетРоли.Вывести(ОблШапкиП);
    ОблШапкиП = Макет.ПолучитьОбласть("ШапкаП|СтолбецП");
    Пока Выборка.Следующий() Цикл
        ОблШапкиП.Параметры.Пользователь = Выборка.Профиль.Наименование;
        ОтчетРоли.Присоединить(ОблШапкиП);
    КонецЦикла;
    Выборка.Сбросить();
    
    ОблСтрокаП = Макет.ПолучитьОбласть("СтрокаП|СтолбецШ");
    ОблРезультат = Макет.ПолучитьОбласть("СтрокаП|СтолбецП");
    
    Для Каждого ТекРоль Из МРолей Цикл
        ОблСтрокаП.Параметры.Роль = ТекРоль;
        ОтчетРоли.Вывести(ОблСтрокаП);
        Пока Выборка.Следующий() Цикл
            
            стрРезультат = "";
            Для каждого РольПрофиля из Выборка.Профиль.Роли Цикл
                Если РольПрофиля.Роль.Имя = ТекРоль Тогда
                    стрРезультат = "Да";
                    Прервать;
                КонецЕсли;
            КонецЦикла;
            ОблРезультат.Параметры.ЗначениеСтроки = стрРезультат;
            ОтчетРоли.Присоединить(ОблРезультат);
        КонецЦикла;
        Выборка.Сбросить();
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьВсеПрофилиГруппДоступа()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ПрофилиГруппДоступа.Ссылка КАК Профиль
        |ИЗ
        |    Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
        |ГДЕ
        |    НЕ ПрофилиГруппДоступа.ПометкаУдаления";
    
    РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса.Выбрать();
    
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

//--NM 14.01.2020